SetPreference
Syntax
SapObject.SapModel.DesignConcrete.ItalianNTC2008C.SetPreference
VB6 Procedure
Function SetPreference(ByVal Item As Long, ByVal Value As Double) As Long
Parameters
Item
This is an integer between 3 and 20, inclusive, indicating the preference item considered.
3 = Second order method
4 = Number of interaction curves
5 = Number of interaction points
6 = Consider minimum eccentricity
7 = Theta0
8 = Gamma steel
9 = Gamma concrete
10 = AlphaCC
11 = AlphaCT
12 = AlphaLCC
13 = AlphaLCT
14 = Pattern live load factor
15 = Utilization factor limit
16 = Multi-response case design
17 = GammacE
18 = Alphae
20 = Consider torsion
Value
The value of the considered preference item.
3 = Second order method
 1 = Nominal stiffness
 2 = Nominal curvature
 3 = None
4 = Number of interaction curves
Value >= 4 and divisible by 4
5 = Number of interaction points
Value >= 5 and odd
6 = Consider minimum eccentricity
0 = No
Any other value = Yes
7 = Theta0
Value > 0
8 = Gamma steel
Value > 0
9 = Gamma concrete
Value > 0
10 = AlphaCC
 Value > 0
11 = AlphaCT
 Value > 0
12 = AlphaLCC
 Value > 0
13 = AlphaLCT
 Value > 0
14 = Pattern live load factor
 Value >= 0
15 = Utilization factor limit
 Value > 0
16 = Multi-response case design
 1 = Envelopes
 2 = Step-by-step
 3 = Last step
 4 = Envelopes -- All
 5 = Step-by-step -- All
 17 = GammacE
 Value > 0
18 = Alphae
 Value > 0
20 = Consider torsion
0 = No
Any other value = Yes
Remarks
This function sets the value of a concrete design preference item.
The function returns zero if the item is successfully set; otherwise, it returns a nonzero value.
VBA Example
Sub SetConcreteDesignPreferenceItemItalianNTC2008C()
 'dimension variables
 Dim SapObject as cOAPI
 Dim SapModel As cSapModel
 Dim ret As Long
 'create Sap2000 object
 Set SapObject = CreateObject("CSI.SAP2000.API.SapObject")
 'start Sap2000 application
 SapObject.ApplicationStart
 'create SapModel object
 Set SapModel = SapObject.SapModel
 'initialize model
 ret = SapModel.InitializeNewModel
 'create new concrete frame section property
 ret = SapModel.PropFrame.SetRectangle("R1", "4000Psi", 20, 12)
 'create model from template
 ret = SapModel.File.New2DFrame(PortalFrame, 2, 144, 2, 288, True,"R1", "R1")
 'set concrete design code
 ret = SapModel.DesignConcrete.SetCode("Italian NTC 2008")
 'set preference item
 ret = SapModel.DesignConcrete.ItalianNTC2008C.SetPreference(5, 9)
 'close Sap2000
 SapObject.ApplicationExit False
 Set SapModel = Nothing
 Set SapObject = Nothing
 End Sub
Release Notes
Initial release in version in v23.4.0.
See Also
GetPreference